app/controllers/authenticated_controller.rb

  def user
    keycloak_id = Keycloak::Helper.current_user_id(request.env)
    puts "------ Keycloak USER ID ------"
    puts keycloak_id
    puts "------ Keycloak USER ID ------"
    User.find_by(keycloak_id: keycloak_id)
---
SELECT "users".* FROM "users" WHERE "users"."keycloak_id" = ? LIMIT ?  [["keycloak_id", "24617716-896c-43d2-8d8f-9f947df7245c"], ["LIMIT", 1]]